In [99]:
# Import Required libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [46]:
#Load the dataset for Domestic_visitors

Domastic16=pd.read_csv("https://raw.githubusercontent.com/mohittomar2008/Telangana-Government-Tourism-Department-Insights/main/Data/domestic_visitors/domestic_visitors_2016.csv")
Domastic17=pd.read_csv("https://raw.githubusercontent.com/mohittomar2008/Telangana-Government-Tourism-Department-Insights/main/Data/domestic_visitors/domestic_visitors_2017.csv")
Domastic18=pd.read_csv("https://raw.githubusercontent.com/mohittomar2008/Telangana-Government-Tourism-Department-Insights/main/Data/domestic_visitors/domestic_visitors_2018.csv")
Domastic19=pd.read_csv("https://raw.githubusercontent.com/mohittomar2008/Telangana-Government-Tourism-Department-Insights/main/Data/domestic_visitors/domestic_visitors_2019.csv")

In [47]:
Domastic16.shape , Domastic17.shape  , Domastic18.shape  , Domastic19.shape

((372, 5), (372, 5), (372, 5), (396, 5))

In [48]:
#Load the dataset for foreign_visitors

foreign16=pd.read_csv("https://raw.githubusercontent.com/mohittomar2008/Telangana-Government-Tourism-Department-Insights/main/Data/foreign_visitors/foreign_visitors_2016.csv")
foreign17=pd.read_csv("https://raw.githubusercontent.com/mohittomar2008/Telangana-Government-Tourism-Department-Insights/main/Data/foreign_visitors/foreign_visitors_2017.csv")
foreign18=pd.read_csv("https://raw.githubusercontent.com/mohittomar2008/Telangana-Government-Tourism-Department-Insights/main/Data/foreign_visitors/foreign_visitors_2018.csv")
foreign19=pd.read_csv("https://raw.githubusercontent.com/mohittomar2008/Telangana-Government-Tourism-Department-Insights/main/Data/foreign_visitors/foreign_visitors_2019.csv")

In [49]:
foreign16.shape , foreign17.shape,  foreign18.shape , foreign19.shape

((372, 5), (372, 5), (372, 5), (396, 5))

In [50]:
Domastic16.head(2)

   district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016   792136
1  Adilabad  01-02-2016  February  2016   937820

In [51]:
foreign16.head(2)

   district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016        2
1  Adilabad  01-02-2016  February  2016        0

In [52]:
# Adding data from different years

domastic= pd.concat([Domastic16,Domastic17,Domastic18,Domastic19], ignore_index=True)
domastic.shape

(1512, 5)

In [53]:
foreign= pd.concat([foreign16,foreign17,foreign18,foreign19], ignore_index=True)
foreign.shape

(1512, 5)

In [54]:
# Both table domastic and foreign have equal rows
# Lets check some data

In [55]:
domastic.sample(3)

       district        date      month  year visitors
8      Adilabad  01-09-2016  September  2016   491279
554    Medchal   01-03-2017      March  2017
1373  Nizamabad  01-06-2019       June  2019      686

In [56]:
foreign.sample(3)

            district        date      month  year visitors
616       Peddapalli  01-05-2017        May  2017        0
224           Nirmal  01-09-2016  September  2016
368  Yadadri Bhongir  01-09-2016  September  2016

In [57]:
domastic['district'].nunique()

33

In [58]:
foreign['district'].nunique()

33

In [59]:
# EDA of domastic data

In [60]:
domastic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   object
 2   month     1512 non-null   object
 3   year      1512 non-null   int64
 4   visitors  1482 non-null   object
dtypes: int64(1), object(4)
memory usage: 59.2+ KB

In [67]:
foreign.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   object
 2   month     1512 non-null   object
 3   year      1512 non-null   int64
 4   visitors  1512 non-null   object
dtypes: int64(1), object(4)
memory usage: 59.2+ KB

In [94]:
# Convert Visitors into Integer
domastic['visitors']=pd.to_numeric(domastic['visitors'], errors='coerce').astype('Int64')
foreign['visitors']=pd.to_numeric(foreign['visitors'], errors='coerce').astype('Int64')

In [95]:
# COnvert date column datatype to date

domastic['date']=pd.to_datetime(domastic['date'])
foreign['date']=pd.to_datetime(foreign['date'])

In [96]:
domastic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   datetime64[ns]
 2   month     1512 non-null   object
 3   year      1512 non-null   int64
 4   visitors  1167 non-null   Int64
dtypes: Int64(1), datetime64[ns](1), int64(1), object(2)
memory usage: 60.7+ KB

In [97]:
foreign.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   datetime64[ns]
 2   month     1512 non-null   object
 3   year      1512 non-null   int64
 4   visitors  1192 non-null   Int64
dtypes: Int64(1), datetime64[ns](1), int64(1), object(2)
memory usage: 60.7+ KB

# Visitors have null values on both domastic and Foreign data
### Data is very less so we will avoid to drop null dataset

In [104]:
domastic.sample(2)

      district       date     month  year  visitors
58    Jangaon  2016-01-11  November  2016     13210
1169  Jangaon  2019-01-06      June  2019     25820

In [121]:
fill_na=domastic.groupby(['district','month'])['visitors'].mean().round().reset_index()
fill_na

            district      month   visitors
0           Adilabad      April    95012.0
1           Adilabad     August   199068.0
2           Adilabad   December    51735.0
3           Adilabad   February   365966.0
4           Adilabad    January   364090.0
..               ...        ...        ...
391  Yadadri Bhongir      March  1281364.0
392  Yadadri Bhongir        May   528777.0
393  Yadadri Bhongir   November   517450.0
394  Yadadri Bhongir    October   559159.0
395  Yadadri Bhongir  September   621712.0

[396 rows x 3 columns]

In [127]:
domastic[domastic['visitors'].isnull()]

                   district       date      month  year  visitors
12    Bhadradri Kothagudem  2016-01-01    January  2016      <NA>
13    Bhadradri Kothagudem  2016-01-02   February  2016      <NA>
14    Bhadradri Kothagudem  2016-01-03      March  2016      <NA>
15    Bhadradri Kothagudem  2016-01-04      April  2016      <NA>
16    Bhadradri Kothagudem  2016-01-05        May  2016      <NA>
...                     ...        ...        ...   ...       ...
1459              Vikarabad 2019-01-08     August  2019      <NA>
1460              Vikarabad 2019-01-09  September  2019      <NA>
1461              Vikarabad 2019-01-10    October  2019      <NA>
1462              Vikarabad 2019-01-11   November  2019      <NA>
1463              Vikarabad 2019-01-12   December  2019      <NA>

[345 rows x 5 columns]

In [124]:
domastic.columns

Index(['district', 'date', 'month', 'year', 'visitors'], dtype='object')